import React from 'react'
import './App.scss'
import './reset.scss'
import Header from "../Header/Header"
import News from '../News/News'
import Gallery from '../Gallery/Gallery'
import Main from '../Main/Main';
import Info from '../Info/Info'
import 'bootstrap/scss/bootstrap.scss'
const Routes = require('react-router-dom').Routes
const Route = require('react-router-dom').Route


export default function App(){

    const pages = [
        {
            id: 1,
            name: 'Реставрація шпиталю',
            image: '1.png',
            description: '27 листопада Юрій Бутусов виклав на особистій сторінці у Фейсбук відео, на якому він здійснює постріл з 152-мм гармати-гаубиці Д-20. Дата та місце зйомки не були вказані.\n' +
                '\n' +
                'На тлі того, що наші західні партнери постійно заявляють про високу ймовірність ескалації  в Україні і дані наших розвідок про присутність російських військ вздовж українського кордону збігаються, Російська Федерація шукає найменший привід для провокацій та реалізації своїх намірів.\n' +
                '\n' +
                'Текст опису зазначеного відео поданий автором у  манері, яка дозволяє використати цю публікацію саме як привід для ускладнення ситуації в районах проведення ООС та для звинувачень України в порушенні домовленостей щодо відведення зброї, у відсутності контролю за зброєю у військах.\n' +
                '\n' +
                'В умовах гібридної війни ворог вже почав використовувати це відео у своїх пропагандистських інтересах. Це підвищує небезпеку провокативних дій з боку російсько-окупаційних військ та підконтрольних їм формувань, посилення обстрілів позицій Об’єднаних Сил, оскільки російська сторона регулярно використовує тактику звинувачень на випередження для прикриття власних злочинів.\n' +
                '\n' +
                'Публікація подібних відео у такому контексті і, зокрема зазначеного, є черговим прикладом того, як свідомо чи несвідомо можна виступити на боці ворогів України в інформаційному протистоянні.\n' +
                '\n' +
                'Вкотре наголошуємо, що Збройні Сили України неухильно дотримуються Мінських домовленостей, не застосовують засоби ураження калібром понад 100 мм та відкривають вогонь виключно у відповідь у випадках, коли дії російських окупаційних військ створюють загрозу для життя і здоров’я українських воїнів та мирних громадян. Підрозділи Об’єднаних сил тримають ситуацію під контролем та продовжують виконувати визначені завдання з відсічі і стримування збройної агресії Російської федерації. Завдяки зусиллям наших воїнів рубежі українських підрозділів залишилися незмінними.',
            date: '10.08.21'
        },
        {
            id: 2,
            name: 'Нова поліклініка',
            image: '26229_1284014069_0.jpg',
            description: 'Станом на 10.00 28 листопада в Збройних Силах України на гостру респіраторну хворобу COVID-19, спричинену коронавірусом SARS-CoV-2, хворіє 1497 осіб. Всього за час пандемії одужало 31 289 осіб, летальних випадків 107. На ізоляції (у тому числі самоізоляції) перебуває 151 особа.\n' +
                '\n' +
                'За минулу добу зареєстровано 16 нових випадків захворювання на гостру респіраторну хворобу COVID-19.\n' +
                '\n' +
                'Вакцинація від COVID-19\n' +
                '\n' +
                'Від початку вакцинальної кампанії у Збройних Силах України 237 049 осіб отримали 1 дозу вакцини. 2 дози вакцини отримали 221 672 особи.\n' +
                '\n' +
                'Щоб вберегти себе та свою родину від інфікування, Командування Медичних сил Збройних Сил України закликає зробити щеплення та дотримуватися правил карантину і особистої гігієни. Нагадуємо, що для набуття стійкого імунітету, після повторного щеплення, повинно пройти не менше двох тижнів. Звертаємося до вас не зволікати з їх здійсненням аби уберегти себе та оточуючих від цієї хвороби. Закликаємо також пояснити важливість здійснення вакцинації своїм близьким та знайомим.',
            date: '18.09.21'
        },
        {
            id: 3,
            name: 'Редизайн',
            image: '1589812_original.jpg',
            description: 'Сьогодні, 27 листопада, в Міністерстві оборони України відбувся щоденний ранковий церемоніал вшанування захисників України, які загинули за свободу, незалежність і територіальну цілісність нашої держави та під час проведення міжнародних операцій з підтримання миру і безпеки.\n' +
                '\n' +
                'У заході взяли участь близькі загиблих героїв, представники керівництва Міністерства оборони України, офіцери та працівники структурних підрозділів оборонного відомства, Генерального штабу ЗС України, військовослужбовці Київського гарнізону.\n' +
                '\n' +
                'Дзвін Пам’яті пролунав три рази...\n' +
                '\n' +
                'У цей день внаслідок бойових дій з російськими окупантами у 2014 році загинули:\n' +
                '\n' +
                'Солдат МУСІЙ Роман Антонович\n' +
                '\n' +
                'Солдат НЕТРЕБКО Олег Володимирович\n' +
                '\n' +
                'Солдат САФІН Олексій Павлович\n' +
                '\n' +
                'Присутні вшанували пам’ять захисників України хвилиною мовчання. Вічна пам’ять Героям, які полягли в боях за нашу вільну, незалежну Україну! Вічна їм Слава!\n' +
                '\n' +
                'Вічна пам’ять Героям, які полягли в боях за нашу вільну, незалежну Україну!\n' +
                '\n' +
                'Довідка. Зала пам’яті захисників України створена на вшанування пам’яті військовослужбовців, які загинули за свободу, незалежність і територіальну цілісність України. Її спеціально розташовано таким чином, щоби й військовослужбовці, працівники Міноборони та Генерального штабу, й пересічні громадяни могли зайти до Зали та віддати шану своїм захисникам.\n' +
                '\n' +
                'Біля споруди Зали пам’яті облаштовано плац для проведення урочистих церемоніальних заходів та Пам’ятний знак, у якій вмонтовано осколки снарядів із Дзвоном Пам’яті. Щоденний поминальний ритуал здійснюється ударами дзвону, залежно від кількості загиблих у цей день.\n' +
                '\n' +
                'В середині Зали пам’яті, на спеціальних подіумах, розміщено Книги пам’яті з іменами загиблих. Структура Книг побудована за принципом календаря: один розворот — один день, де згадуються всі загиблі у цей день за всі роки.',
            date: '02.10.21'
        },
        {
            id: 4,
            name: 'Допомога волонтерів',
            image: '1701115.jpg',
            description: '19 листопада 2021 року Департамент державних закупівель Міністерства оборони України оголосив про закупівлі 53 тисяч тонн дизельного арктичного та літнього палива через систему Прозорро.\n' +
                '\n' +
                'Станом на 26 листопада 2021 року, Департаментом державних закупівель Міноборони відпрацьовано 100% заявок на проведення закупівель на паливні матеріали, що надходили від Командування Сил логістики ЗС України.\n' +
                '\n' +
                'Міністерство оборони України наразі проводить процедури закупівель 42 134 тонн палива дизельного арктичного та 11 600 тонн палива дизельного літнього з кінцевим терміном постачання до 21 грудня 2021 року.\n' +
                '\n' +
                '«Завдяки плідній роботі та комунікації із профільним Комітетом Верховної Ради питання закупівлі пального для нашої армії зсунулось з мертвої точки. Дуже дякую колегам-парламентарям за допомогу й підтримку у вирішенні цього важливого питання», — наголосив заступник Міністра оборони Вячеслав Шаповалов.\n' +
                '\n' +
                'На сьогодні Збройні Сили України забезпечені бензинами: А95, А92, А80 на 100% від потреби ЗС України, літнім та авіаційним пальним на 57% та 80% відповідно.',
            date: '10.08.21'
        }
    ]

    return(
        <div className={'page'}>

            <Routes>
                <Route path={'/'} element={<Header/>}>
                    <Route index element={<Main news={pages}/>}/>
                    <Route path={'news'} element={<News news={pages}/>}/>
                    <Route path={'gallery'} element={<Gallery news={pages}/>}/>
                    <Route path={'info'} element={<Info/>}/>
                </Route>
            </Routes>
        </div>
    )
}